app/views/users/show.html.erb

  		</h1>
      <% unless @user.events.empty? %>
---
SELECT COUNT(*) FROM "events" WHERE ("events".user_id = 1)