app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY events.created_at DESC
---
	def allevent
	    @title = "All Posts"
      @feed_items = Event.all.paginate(:page => params[:page])