app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY created_at DESC
---
	def index
    @feed_items = Event.all

SELECT "events".* FROM "events" WHERE ("events"."event_type" = 'free') ORDER BY created_at DESC
---
	def free
    @feed_items = Event.where(:event_type => 'Free')

SELECT "events".* FROM "events" WHERE ("events"."event_type" = 'Cheap') ORDER BY created_at DESC
---
	def cheap
    @feed_items = Event.where(:event_type => 'Cheap')

INSERT INTO "events" ("startdate", "event_title", "created_at", "occurence", "event_type", "enddate", "description", "user_id", "endtime", "updated_at", "starttime", "price") VALUES ('2011-03-15 04:00:00.000000', 'Light''s Free Pizza at Molly''s', '2011-03-15 00:07:18.258793', 'One-Time', 'Free', '2011-03-16 04:00:00.000000', 'Join us for our free pizza!', 1, '2011-03-15 02:06:00.000000', '2011-03-15 00:07:18.258793', '2011-03-15 00:06:00.000000', NULL)
---
	def create
		@event = current_user.events.build(params[:event])
		if @event.save

SELECT "events".* FROM "events" WHERE ("events"."id" = 1) ORDER BY created_at DESC LIMIT 1
---
  def show
    @event = Event.find(params[:id])

DELETE FROM "events" WHERE ("events"."id" = 1)
---
	def destroy
		@event.destroy