app/controllers/pages_controller.rb

SELECT "events".* FROM "events" WHERE (user_id = 1) LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE ("events".user_id = 1)
---
  def home
    @title = "Home"
    @feed_items = Event.all.paginate #must include .paginate