app/controllers/pages_controller.rb

  def home
      @title = "Home"
      @feed_item1 = Event.find(4)
---
SELECT "events".* FROM "events" WHERE ("events"."id" = 1) ORDER BY events.created_at DESC LIMIT 1