app/controllers/users_controller.rb

DELETE FROM "users" WHERE ("users"."id" = 2)
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def destroy
  	User.find(params[:id]).destroy

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
---
  def index
  	@title = "All Users"
  	@users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "events".* FROM "events" WHERE ("events".user_id = 1) ORDER BY events.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE ("events".user_id = 1)
---
  def show
  	@user = User.find(params[:id])
  	@title = @user.name + "'s Profile"
  	@events = @user.events.paginate(:page => params[:page])

INSERT INTO "users" ("salt", "admin", "encrypted_password", "updated_at", "created_at", "email", "name") VALUES ('4e591a8c29bca146bce6a738f3d7c0b6b560e7816e0ca707071786fa6f957322', 'f', '42901cce4f29523de06e1f0192877a3afc1710aa4c086fa64bf3a6eb8f916642', '2011-02-26 02:59:39.864839', '2011-02-26 02:59:39.864839', 'amanuel_allan@yahoo.ca', 'Allan Manuel')
---
  def create
  	@user = User.new(params[:user])
  	if @user.save